run/pitzDaily_PANSkEps_gather/pitzDaily_adjustable_fK/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType      RAS;

RAS
{
    RASModel        PANSkEpsilon;
    
    PANSkEpsilonCoeffs
    {
        // fK bounds. fK -> 1.0 RAS, fK -> 0 DNS
        fKupperLimit  0.5; // default: 1.0
        fKlowerLimit  0.1; // default: 0.1

        delta cubeRootVol; // delta for fK using LESdelta

        cubeRootVolCoeffs{}
    }

    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
